{
  "name": "Marius Olariu",
  "role": "Software Team Leader",
  "philosophy": "Virtus junxit mors non separabit.",
  "contact": {
    "email": "marius.lucian.olariu@gmail.com",
    "location": "https://maps.app.goo.gl/oGVJc1S68M2jk2ex5",
    "website": "marius-olariu.net",
    "github": "https://github.com/mariusolariu",
    "linkedin": "https://www.linkedin.com/in/mlo1994/"
  },
  "education": [
    {
      "name": "University of the West of Scotland",
      "location": "Paisley, United Kingdom",
      "period": "2018-2020",
      "degree": "Mobile Web Development",
      "website": "https://www.uws.ac.uk/",
      "logo": "uws_logo.png",
      "link_to_degree": "",
      "programme_type": "Master of Science"
    },
    {
      "name": "Polytechnic University Timișoara",
      "location": "Timișoara, Romania",
      "period": "2014-2018",
      "degree": "Computer and Software Engineering",
      "website": "https://www.upt.ro/Universitatea-Politehnica-Timisoara_en.html",
      "link_to_degree": "",
      "logo": "logo_upt.png",
      "programme_type": "Bachelor of Science"
    },
    {
      "name": "Linköping University",
      "location": "Linköping, Sweden",
      "period": "Spring semester 2017",
      "degree": "Exchange Semester",
      "website": "https://liu.se/en",
      "logo": "liu_logo.png",
      "programme_type": "Erasmus Programme"
    },
    {
      "name": "Radboud University",
      "location": "Nijmegen, The Netherlands",
      "period": "Autumn semester 2016",
      "degree": "Exchange Semester",
      "website": "https://www.ru.nl/english/",
      "logo": "radboud_logo.png",
      "programme_type": "Erasmus Programme"
    }
  ],
  "experience": [
    {
      "company": {
        "name": "Vodafone UK",
        "role": "Software Team Leader",
        "period": "Apr 2023 - present",
        "logo": "vodafone.png",
        "location": "London, United Kingdom",
        "website": "https://www.vodafone.co.uk"
      },
      "project": {
        "name": "vodafone.co.uk",
        "logoHeight": 80,
        "role": "Software Team Leader",
        "description": "As a Software Team Leader at Vodafone, I spearhead the development of our website's features, combining my deep passion for technology and continuous learning.  My leadership is characterized by fostering a collaborative environment, encouraging innovation, and maintaining open communication channels with both colleagues and stakeholders.    This approach not only enhances our team's efficiency but also ensures we consistently deliver high-quality solutions that meet our users' evolving needs.",
        "stack": {
          "me": [
            "Leadership",
            "Time management",
            "Mentoring",
            "Java",
            "Spring",
            "AWS"
          ]
        }
      }
    },
    {
      "company": {
        "name": "Vodafone UK",
        "role": "Backend Software Engineer",
        "period": "Feb 2023 - present",
        "logo": "vodafone.png",
        "location": "London, United Kingdom",
        "website": "https://www.vodafone.co.uk"
      },
      "project": {
        "name": "vodafone.co.uk",
        "logoHeight": 80,
        "role": "Software Engineer",
        "description": "In my role as a Backend Software Engineer at Vodafone, I elevated the checkout experience on vodafone.co.uk to unparalleled smoothness, directly enhancing user satisfaction. My dedication to innovation and operational excellence, evidenced by surpassing 80% of my Objectives and Key Results (OKRs) and garnering outstanding peer feedback, propelled me to a leadership position. Additionally, my recognition as Top Talent—a distinction shared by only four individuals—underscores my commitment to pushing the boundaries of technology and teamwork",
        "stack": {
          "me": [
            "Java",
            "Spring",
            "AWS",
            "JUnit",
            "Maven",
            "Git"
          ]
        }
      }
    },
    {
      "company": {
        "name": "Zühlke Group",
        "role": "Senior Software Engineer",
        "period": "Oct 2022 - Dec 2022",
        "logo": "zuhlke.png",
        "location": "London, United Kingdom",
        "website": "https://www.zuehlke.com/en"
      },
      "projects": {
        "name": "Learning and waiting for a client",
        "logoHeight": 80,
        "role": "Senior Software Engineer",
        "description": "Brief period at this consulting company due to a temporary lull in demand for Java Backend Software Engineers (inflation raising and recession was predicted).",
        "stack": {
          "me": [
            "Java",
            "Spring",
            "AWS",
            "JUnit",
            "Maven",
            "Git"
          ]
        }
      }
    },
    {
      "company": {
        "name": "IQVIA",
        "role": "Full Stack Software Engineer",
        "period": "Feb 2022 - Oct 2022",
        "logo": "iqvia.png",
        "location": "London, United Kingdom",
        "website": "https://www.iqvia.com/"
      },
      "project": {
        "name": "Clinspark",
        "logoHeight": 80,
        "role": "Full Stack Software Engineer",
        "description": "As a Full Stack Developer, I was actively involved in the development of a robust eSource web application system, designed to facilitate the drug development process for leading pharmacology companies. My role encompassed both front-end and back-end development, ensuring a seamless user experience and robust functionality. Additionally, I played a key role in managing our AWS infrastructure to enhance scalability and reliability. This included troubleshooting and resolving production issues to maintain optimal performance and service uptime. I also collaborated closely with clients, Biomedical Engineers, and Project Managers to develop clear, actionable specifications for user stories. This role demanded a high level of technical proficiency and strong communication skills, as it was essential to effectively translate client needs into technical requirements and foster a collaborative environment.",
        "stack": {
          "me": [
            "Java",
            "AWS",
            "JavaScript",
            "Groovy",
            "Grails",
            "Maven",
            "Git"
          ]
        }
      }
    },
    {
      "company": {
        "name": "Diffblue",
        "role": "Software Engineer",
        "period": "August 2020 - Feb 2022",
        "logo": "diffblue.png",
        "location": "Oxford, United Kingdom",
        "website": "https://diffblue.com"
      },
      "project": {
        "name": "Diffblue Cover",
        "logoHeight": 80,
        "role": "Software Engineer",
        "description": "As a Java Developer, I specialized in software development for Diffblue Cover, an AI-driven tool that autonomously generates tests for Java applications, within an Agile framework. I consistently enhanced my technical and industry knowledge through dedicated learning initiatives every Sprint. In a leadership capacity, I directed daily stand-ups and Sprint Retrospectives, contributing to project management and team guidance. Additionally, I established and managed an online demo environment for Diffblue Cover, facilitating hands-on experiences for prospective clients and demonstrating both technical proficiency and proactivity.",
        "stack": {
          "me": [
            "Java",
            "Spring",
            "JUnit",
            "Maven",
            "Git"
          ]
        }
      }
    },
    {
      "company": {
        "name": "New Verve Consulting",
        "role": "Junior Software Engineer",
        "period": "August 2019 - August 2020",
        "logo": "new_verve.png",
        "location": "Glasgow, United Kingdom",
        "website": "https://newverveconsulting.com"
      },
      "project": {
        "name": "Crumbs",
        "logoHeight": 80,
        "role": "Junior Fullstack Developer",
        "description": "I played a pivotal role in the development and successful launch of CRUMBS, a lightweight Customer Relationship Management (CRM) add-on for Jira, enhancing user engagement and functionality. I also mentored a colleague transitioning from Technical Consultant to Developer, guiding him through pair-programming, demonstrations, and knowledge transfer sessions, which enhanced team capabilities and individual growth. Additionally, I effectively balanced my responsibilities with completing my MSc dissertation, showcasing exceptional time management and multitasking skills.",
        "stack": {
          "me": [
            "JavaScript",
            "React",
            "Node",
            "Jest",
            "Git"
          ]
        }
      }
    },
    {
      "company": {
        "name": "SSI Schaefer",
        "role": "Junior Software Engineer",
        "period": "August 2017 - August 2018",
        "logo": "schaefer.png",
        "location": "Timisoara, Romania",
        "website": "https://ssi-schaefer.com"
      },
      "projects": [
        {
          "name": "LOGIMAT",
          "logoHeight": 80,
          "role": "Junior Software Engineer",
          "description": "I contributed to the development of a software for the vertical lift module (LOGIMAT), aimed at optimizing goods storage and management in a warehouse. This project utilized my skills in Java, SQL/HQL, JUnit, Maven, and Git. Alongside software development, I successfully managed my time between my final year of BSc studies in Computer Science and this job, demonstrating robust time management abilities. This dual commitment allowed me to gain practical experience in professional software development, further enriching my academic and technical proficiency.",
          "stack": {
            "me": [
              "Java",
              "SQL",
              "JUnit",
              "HQL",
              "Git"
            ]
          }
        }
      ]
    }
  ],
  "recommendations": [
    {
      "name": "Uwe Rohloff",
      "jobTitle": "Vice President Research & Development",
      "photo": "uwe.jpeg",
      "linkedin": "https://www.linkedin.com/in/uwe-rohloff-845692/",
      "text": "Marius is a hard working development senior and always striving to learn and improve - himself as well as others! I had the pleasure being his superior some time ago and was quite happy to see him being always determined to learn more, share knowledge and go the extra mile in achieving great solutions."
    },
    {
      "name": "Joel Allred",
      "jobTitle": "Software Engineering Manager",
      "photo": "joel.jpeg",
      "linkedin": "https://www.linkedin.com/in/joel-allred/",
      "text": "I have had the pleasure to have Marius on my team. He took ownership of the Katacoda front end for Diffblue Cover and made some excellent contributions to the core test generation Java engine. Marius is eager to learn and continuously looks for process and code quality improvements."
    },
    {
      "name": "Gabriel Boian",
      "jobTitle": "Software Team Leader",
      "photo": "gabi.jpeg",
      "linkedin": "https://www.linkedin.com/in/gabriel-boian-aba85351/",
      "text": "I had the pleasure to work with Marius for almost a year while he was graduating the university and he was a Junior Developer in the team that I managed. I was impressed by Marius' ability to handle parallel tasks like completing the study workload and picking development in a complex and big framework used inside our product. He managed very well to solve tasks requiring back-end technologies like SQL but also front-end tasks requiring him to master the framework used for the UI development. He proved his capability to handle difficult problems. As a team member or leader, Marius earns my highest recommendation."
    },
    {
      "name": "Nigel Rochford",
      "jobTitle": "Founder & Managing Director",
      "photo": "nigel.jpeg",
      "linkedin": "https://www.linkedin.com/in/nigelrochford/",
      "text": "Marius was a great asset to New Verve when he worked as a Junior Developer - we were sorry to see him leave. He played a key part in our evolving business strategy by helping our products team design, develop, and launch a Cloud product to a global marketplace for the very first time. This was no mean feat and I was impressed with his autonomy and willingness to adapt and learn. He also built a sold rapport with team mates throughout the journey. Best of luck Marius with the rest of your career!"
    },
    {
      "name": "Darran Gillan",
      "jobTitle": "Digital Inclusion Development Officer",
      "photo": "darran.jpeg",
      "linkedin": "https://www.linkedin.com/in/darran-gillan/",
      "text": "Marius developed a lone working app for Paisley YMCA youth work staff. This was all built from the ground up and Marius attention to detail and advice to the requirements identified from a mobile phone app was very insightful and helped transform our youth work operations to a paperless system saving our organisation time and money. Throughout this process Marius made all staff feel involved in the design and functionality of the app despite our lack of understanding in some areas his professional attitude and enthusiasm for our organisations aim that was reflected in this lone working app developed by Marius during his time at Paisley YMCA has made our organisation stand out in terms use of digital platforms to improve outcomes for young people within the youth work sector."
    },
    {
      "name": "Alex Quail",
      "jobTitle": "Software Product Owner",
      "photo": "alex.jpeg",
      "linkedin": "https://www.linkedin.com/in/alexquail/",
      "text": "It has been a pleasure working with Marius during his time at Foundry Health / IQVIA. He is an excellent communicator and hard worker. He helped to enhance our core product during a release cycle, where he implemented improvements towards existing features. He also suggested improvements to the product and our processes over time as he gained more understanding about our business and industry. As a Product Manager, I really appreciate his direct working style and willingness to gain a deep understanding of product/user needs from the perspective of a developer. He makes an effort to understand the 'why' and not only just the 'what'. Overall I appreciate that Marius took strong opinions about his work, was always willing to ask questions and learn, and ensured that he spend time in the most efficient way possible. He's also genuinely a nice person which made it easy to approach him for questions or to collaborate."
    },
    {
      "name": "Benjamin Haws, PMP",
      "jobTitle": "Founder & Managing Director",
      "photo": "ben.jpeg",
      "linkedin": "https://www.linkedin.com/in/benh937/",
      "text": "I worked as Project Manager with Marius on various projects in the clinical software space. He is eager to learn and grow. He is great at understanding his prioritization and working efficiently and asking the questions needing answers to be successful. He takes self-ownership of the tasks at hand and immediately communicates any blockers/issues. All in all working with Marius was a pleasure. I hope are paths cross again in the future."
    }
  ],
  "skills": [
    "Java",
    "Spring",
    "AWS",
    "React",
    "JavaScript",
    "GenAI",
    "Git",
    "Maven",
    "HTML",
    "CSS",
    "C/C++"
  ],
  "values": [
    "Faith",
    "Integrity",
    "Friendship",
    "Respect",
    "Service"
  ]
}